# Filtering Data

In [28]:
import pandas as pd

In [29]:
titanic = pd.read_csv("titanic.csv")
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [30]:
titanic.sex == "male"

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888    False
889     True
890     True
Name: sex, Length: 891, dtype: bool

In [31]:
titanic.loc[titanic.sex == "male","fare"]

0       7.2500
4       8.0500
5       8.4583
6      51.8625
7      21.0750
        ...
883    10.5000
884     7.0500
886    13.0000
889    30.0000
890     7.7500
Name: fare, Length: 577, dtype: float64

In [ ]:
mask1 = titanic.sex == "male"
mask1

In [ ]:
titanic_male = titanic.loc[mask1]

In [ ]:
titanic_male

In [ ]:
mask2 = titanic.age > 14
mask2

In [ ]:
male_adult = titanic.loc[mask1 & mask2,["survived","pclass","sex","age"]]
male_adult

In [ ]:
mask3 = titanic.sex == "female"
mask3

In [ ]:
mask4 = titanic.age < 20
mask4
mask4.head(20)

In [ ]:
titanic.loc[mask3 | mask4]

In [ ]:
women_or_child = titanic.loc[mask3 | mask4,["survived","pclass","sex","age"]]

In [ ]:
women_or_child